"""
Нахождение корня функции с тчностью e
методом деления отрезка (бисекции)
"""
import math


def f(x: float) -> float:
    return x ** 3 + 2 * x - 2


if __name__ == "__main__":
    print("Введите концы промежутка")
    a = float(input("A = "))  # запрос концов исходного промежутка
    b = float(input("B = "))

    print("Введите точность")
    e = float(input("E = "))  # и точности
    
    while b - a > 2 * e:
        c = (a + b) / 2  # середина отрезка [a, b]
        
        if f(a) * f(c) > 0:
            a = c
        else:
            b = c  # [a, c] или [c, b] ?
    
    print(f"Значение корня с точностью {e} равно ({a} + {b}) / 2 = {(a + b) / 2}")
